In [1]:
# pandas course - started 2021/01/23 - 1:49 PM, objective is to complete this by the EOD

In [2]:
# pandas is the most popular Python library for data analysis

In [3]:
# importing pandas
import pandas as pd

In [4]:
# two core objects datframes and Series

In [5]:
#DataFrame is a table, it contains an array of individual entries, each of which has a certain value, each entry corrsonds with  arow (or records) an a column

In [6]:
pd.DataFrame({'Yes': [50,21], 'No':[131,2]})

   Yes   No
0   50  131
1   21    2

In [8]:
# entries can be strings
pd.DataFrame({'Yes': ['Alice','Stacy'], 'No':['Abraham','Lisa']})

     Yes       No
0  Alice  Abraham
1  Stacy     Lisa

In [9]:
# in the example aboves, the entry is a dictionay with the keys as the colums as the column name and the values as the rows
# the example above has the idnex as 0,1...
# you can change it by the argument index
pd.DataFrame({'Yes': ['Alice','Stacy'], 'No':['Abraham','Lisa']}, index=[12,12])

      Yes       No
12  Alice  Abraham
12  Stacy     Lisa

In [10]:
# you can also make it look better by indenting properly
pd.DataFrame({'Yes': ['Alice','Stacy'], 
              'No':['Abraham','Lisa']}, 
             index=[12,12])

      Yes       No
12  Alice  Abraham
12  Stacy     Lisa

In [11]:
# Series - by contrast is a seqence of data values, If a DataFrame is a table, a Series is a list
# can be easily created with a list
pd.Series([1,2,'fast','and','furios'])

0         1
1         2
2      fast
3       and
4    furios
dtype: object

In [14]:
# giving names to indexes
pd.Series([1,2,3,3,4,4,5,5,4],
         index=[11,22,33,44,55,66,77,88,99],
         name='Seriesp')

11    1
22    2
33    3
44    3
55    4
66    4
77    5
88    5
99    4
Name: Seriesp, dtype: int64

In [20]:
pd.DataFrame({'Name':['GSP', 8 ,'DSP'], 
              'Favorite Color':['Red', 8 ,'Blue']}, 
             index =['Name1',8 ,'Name3'])

      Name Favorite Color
Name1  GSP            Red
8        8              8
Name3  DSP           Blue

In [22]:
pd.Series(['test','of','the','people','of', 1])

0      test
1        of
2       the
3    people
4        of
5         1
dtype: object

In [26]:
list1 = [i for i in range(20)]
pd.Series(list1,index= [i**3 for i in range(20)], name = 'Series3' )

0        0
1        1
8        2
27       3
64       4
125      5
216      6
343      7
512      8
729      9
1000    10
1331    11
1728    12
2197    13
2744    14
3375    15
4096    16
4913    17
5832    18
6859    19
Name: Series3, dtype: int64

In [28]:
win_reviews = pd.read_csv("toy_dataset/toy_dataset.csv")
win_reviews.shape

(150000, 6)

In [29]:
win_reviews.head()

   Number    City Gender  Age   Income Illness
0       1  Dallas   Male   41  40367.0      No
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No
4       5  Dallas   Male   46  50289.0      No

In [32]:
win_reviews.tail()

        Number    City  Gender  Age    Income Illness
149995  149996  Austin    Male   48   93669.0      No
149996  149997  Austin    Male   25   96748.0      No
149997  149998  Austin    Male   26  111885.0      No
149998  149999  Austin    Male   25  111878.0      No
149999  150000  Austin  Female   37   87251.0      No

In [33]:
win_reviews = pd.read_csv("toy_dataset/toy_dataset.csv", index_col=0)
win_reviews

          City  Gender  Age    Income Illness
Number
1       Dallas    Male   41   40367.0      No
2       Dallas    Male   54   45084.0      No
3       Dallas    Male   42   52483.0      No
4       Dallas    Male   40   40941.0      No
5       Dallas    Male   46   50289.0      No
...        ...     ...  ...       ...     ...
149996  Austin    Male   48   93669.0      No
149997  Austin    Male   25   96748.0      No
149998  Austin    Male   26  111885.0      No
149999  Austin    Male   25  111878.0      No
150000  Austin  Female   37   87251.0      No

[150000 rows x 5 columns]